OpenNuvoton/M251BSP/Library/StdDriver/src/pwm.c
/**************************************************************************//**
 * @file     pwm.c
 * @version  V0.10
 * @brief    M251 series PWM driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2019 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup PWM_Driver PWM Driver
  @{
*/


/** @addtogroup PWM_EXPORTED_FUNCTIONS PWM Exported Functions
  @{
*/

/**
 * @brief Configure PWM capture and get the nearest unit time.
 * @param[in] pwm The pointer of the specified PWM module
 *                - PWM0 : PWM Group 0
 *                - PWM1 : PWM Group 1
 * @param[in] u32ChannelNum PWM channel number. Valid values are between 0~5
 * @param[in] u32UnitTimeNsec The unit time of counter
 * @param[in] u32CaptureEdge The condition to latch the counter. This parameter is not used
 * @return The nearest unit time in nano second.
 * @details This function is used to Configure PWM capture and get the nearest unit time.
 */
uint32_t PWM_ConfigCaptureChannel(PWM_T *pwm, uint32_t u32ChannelNum, uint32_t u32UnitTimeNsec, uint32_t u32CaptureEdge)
{
    (void) u32CaptureEdge;
    uint32_t u32Src;
    uint32_t u32PWMClockSrc;
    uint32_t u32NearestUnitTimeNsec = 0UL;
    uint16_t u16Prescale = 1UL, u16CNR = 0xFFFFUL;
    uint8_t u8BreakLoop = 0UL;

    // M251/2_C clock source is not supported PLL
    if ((SYS->PDID & 0xfff0) == 0x52E0 || (SYS->PDID & 0xfff0) == 0x52A0 || (SYS->PDID & 0xfff0) == 0x52B0 || (SYS->PDID & 0xfff0) == 0x51E0 || (SYS->PDID & 0xfff0) == 0x51A0
            || (SYS->PDID & 0xfff0) == 0x51B0)
    {
        if (pwm == PWM0)
        {
            u32Src = CLK_CLKSEL2_PWM0SEL_PCLK0;
        }
        else     /* (pwm == PWM1) */
        {
            u32Src = CLK_CLKSEL2_PWM1SEL_PCLK1;
        }
    }
    else
    {
        if (pwm == PWM0)
            u32Src = CLK->CLKSEL2 & CLK_CLKSEL2_PWM0SEL_Msk;
        else//(pwm == PWM1)
            u32Src = CLK->CLKSEL2 & CLK_CLKSEL2_PWM1SEL_Msk;
    }

    if (u32Src == 0UL)
    {
        //clock source is from PLL clock
        u32PWMClockSrc = CLK_GetPLLClockFreq();
    }
    else
    {
        //clock source is from PCLK
        SystemCoreClockUpdate();

        if (pwm == PWM0)
        {
            u32PWMClockSrc = CLK_GetPCLK0Freq();
        }
        else     /* (pwm == PWM1) */
        {
            u32PWMClockSrc = CLK_GetPCLK1Freq();
        }
    }

    u32PWMClockSrc /= 1000UL;

    for (u16Prescale = 1UL; u16Prescale <= 0x1000UL; u16Prescale++)
    {
        u32NearestUnitTimeNsec = (1000000UL * u16Prescale) / u32PWMClockSrc;

        if (u32NearestUnitTimeNsec < u32UnitTimeNsec)
        {
            if (u16Prescale == 0x1000UL)
            {
                /* limit to the maximum unit time(nano second) */
                u8BreakLoop = 1UL;
            }

            if (!((1000000UL * (u16Prescale + 1UL) > (u32NearestUnitTimeNsec * u32PWMClockSrc))))
            {
                u8BreakLoop = 1UL;
            }
        }
        else
        {
            u8BreakLoop = 1UL;
        }

        if (u8BreakLoop)
        {
            break;
        }
    }

    // convert to real register value
    u16Prescale = u16Prescale - 1UL;
    // every two channels share a prescaler
    PWM_SET_PRESCALER(pwm, u32ChannelNum, (uint32_t)u16Prescale);

    // set PWM to down count type(edge aligned)
    (pwm)->CTL1 = ((pwm)->CTL1 & ~(PWM_CTL1_CNTTYPE0_Msk << ((u32ChannelNum >> 1UL) << 2UL))) | (1UL << ((u32ChannelNum >> 1UL) << 2UL));

    PWM_SET_CNR(pwm, u32ChannelNum, u16CNR);

    return (u32NearestUnitTimeNsec);
}

/**
 * @brief This function Configure PWM generator and get the nearest frequency in up count auto-reload mode
 * @param[in] pwm The pointer of the specified PWM module
 *                - PWM0 : PWM Group 0
 *                - PWM1 : PWM Group 1
 * @param[in] u32ChannelNum PWM channel number. Valid values are between 0~5
 * @param[in] u32Frequency Target generator frequency
 * @param[in] u32DutyCycle Target generator duty cycle percentage. Valid range are between 0 ~ 100. 10 means 10%, 20 means 20%...
 * @return Nearest frequency clock
 * @note Since every two channels, (0 & 1), (2 & 3), shares a prescaler. Call this API to configure PWM frequency may affect
 *       existing frequency of other channel.
 */
uint32_t PWM_ConfigOutputChannel(PWM_T *pwm, uint32_t u32ChannelNum, uint32_t u32Frequency, uint32_t u32DutyCycle)
{
    uint32_t u32Src, u32PWMClockSrc;
    uint32_t u32NearestFrequency, u32NearestCNR, u32CNR = 0x10000UL;
    uint32_t u32Prescale = 1UL;

    if (u32Frequency == 0)
        return u32Frequency;

    // M251/2_C clock source is not supported PLL
    if ((SYS->PDID & 0xfff0) == 0x52E0 || (SYS->PDID & 0xfff0) == 0x52A0 || (SYS->PDID & 0xfff0) == 0x52B0 || (SYS->PDID & 0xfff0) == 0x51E0 || (SYS->PDID & 0xfff0) == 0x51A0
            || (SYS->PDID & 0xfff0) == 0x51B0)
    {
        if (pwm == PWM0)
        {
            u32Src = CLK_CLKSEL2_PWM0SEL_PCLK0;
        }
        else     /* (pwm == PWM1) */
        {
            u32Src = CLK_CLKSEL2_PWM1SEL_PCLK1;
        }
    }
    else
    {
        if (pwm == PWM0)
            u32Src = CLK->CLKSEL2 & CLK_CLKSEL2_PWM0SEL_Msk;
        else//(pwm == PWM1)
            u32Src = CLK->CLKSEL2 & CLK_CLKSEL2_PWM1SEL_Msk;
    }

    if (u32Src == 0UL)
    {
        //clock source is from PLL clock
        u32PWMClockSrc = CLK_GetPLLClockFreq();
    }
    else
    {
        //clock source is from PCLK
        SystemCoreClockUpdate();

        if (pwm == PWM0)
        {
            u32PWMClockSrc = CLK_GetPCLK0Freq();
        }
        else     /* (pwm == PWM1) */
        {
            u32PWMClockSrc = CLK_GetPCLK1Freq();
        }
    }

    if (u32Frequency > u32PWMClockSrc)
        return 0;

    for (u32Prescale = 1UL; u32Prescale <= 0x1000UL; u32Prescale++)   //CLKPSC could be 0~0xFFF
    {
        u32NearestCNR = (u32PWMClockSrc / u32Frequency) / u32Prescale;

        // If target value is larger than CNR, need to use a larger prescaler
        if (u32NearestCNR <= (0x10000UL))
        {
            u32CNR = u32NearestCNR;
            break;
        }
    }

